mm399-dev-sw/micropython-tiva/ports/tm4c123/mods/pwm.c
    machine_pwm_obj_t* twin = &machine_pwm_obj[(self->id % 2 ? self->id - 1: self->id + 1)];
    // if twin pwm is active dont allow different frequency
    if (twin->freq && val != twin->freq)
        mp_raise_ValueError(MP_ERROR_TEXT("Frequency must be the same inside one PWM generator"));

    uint32_t load_val = pwm_freq / val;
    if (load_val > 0xffff)
        mp_raise_ValueError(MP_ERROR_TEXT("Frequency to low, consider adjusting the PWM clock divider via PWM.clock_divider(PWM.CLK_DIV_x)"));
    
    PWMGenPeriodSet(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id], load_val);
    PWMSyncTimeBase(pwm_mod_reg_map[self->mod_id], 1 << self->gen_id);
    self->load = load_val;
    self->freq = val;
}

void pwm_update_duty(machine_pwm_obj_t* self, uint8_t val)
{
    if (val > 100)
        mp_raise_ValueError(MP_ERROR_TEXT("Value out of range"));
    
    uint16_t comp_val = 0;
    comp_val = val * self->load / 100;
    
    // reenable output if duty was 0%
    if (val && self->duty == 0)
        PWMOutputState(pwm_mod_reg_map[self->mod_id], 1 << (self->id % PWM_M1PWM0), 1);
    
    // set pulse width
    if (val)
        PWMPulseWidthSet(pwm_mod_reg_map[self->mod_id], pwm_out_reg_map[self->id % PWM_M1PWM0], comp_val);
    // silently disable output as left aligned PWM does not allow for 0% duty cycle
    else
        PWMOutputState(pwm_mod_reg_map[self->mod_id], 1 << (self->id % PWM_M1PWM0), 0);
    
    self->duty = val;
}

void pwm_update_sync(machine_pwm_obj_t* self, const machine_pwm_obj_t* tbs, uint8_t n_tbs)
{
    uint8_t tbs_flag = (1 << self->gen_id) << (4 * self->mod_id);
    for (uint8_t i = 0; i < n_tbs; i++)
        tbs_flag |= (1 << tbs[i].gen_id) << (4 * tbs[i].mod_id);
    if (tbs_flag & 0x0f)
        PWMSyncTimeBase(pwm_mod_reg_map[0], tbs_flag & 0x0f);
    if (tbs_flag & 0xf0)
        PWMSyncTimeBase(pwm_mod_reg_map[1], (tbs_flag >> 4) & 0x0f);
}

void pwm_update_db(machine_pwm_obj_t* self, uint16_t db_falling, uint16_t db_rising)
{
    PWMDeadBandEnable(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id], db_rising, db_falling);
    self->db_falling = db_falling;
    self->db_rising = db_rising;
    // update values for twin
    machine_pwm_obj[(self->id % 2 ? self->id - 1: self->id + 1)].db_falling = db_falling;
    machine_pwm_obj[(self->id % 2 ? self->id - 1: self->id + 1)].db_rising = db_rising;
}

void pwm_update_irq(machine_pwm_obj_t* self, mp_obj_t irq, uint16_t irq_mode)
{
    // disable irq
    if (mp_obj_is_type(irq, &mp_type_NoneType))
    {

    }
    // setup irq
    else if (mp_obj_is_fun(irq))
    {

    }
    self->irq_mode = irq_mode;
}

void pwm_update_fault(machine_pwm_obj_t* self, bool val)
{

}

void pwm_set_gpio(machine_pwm_obj_t* self, bool val)
{
    // alternate pin
    if (pwm_get_id_from_pin(self->pin, 1) == self->id)
        self->alternate_pin = 1;
    // standard pin not found
    else if (pwm_get_id_from_pin(self->pin, 0) != self->id)
        mp_raise_ValueError(MP_ERROR_TEXT("Can't setup pin for PWM"));

    SysCtlPeripheralEnable(self->pin->periph);
    while (!SysCtlPeripheralReady(self->pin->periph));
    GPIOPinConfigure(gpio_af_val_map[self->id][self->alternate_pin]);
    GPIOPinTypePWM(self->pin->gpio, 1 << get_pin_index_from_pin(self->pin));
}

void pwm_init(machine_pwm_obj_t* self, const pin_obj_t* pin, bool active, bool invert, uint32_t freq, uint8_t duty, uint16_t db_falling, uint16_t db_rising, uint32_t mode, mp_obj_t irq, uint16_t irq_mode, mp_obj_t fault)
{
    SysCtlPeripheralEnable(pwm_periph_reg_map[self->mod_id]);
    while (!SysCtlPeripheralReady(pwm_periph_reg_map[self->mod_id]));

    machine_pwm_obj_t* twin = &machine_pwm_obj[(self->id % 2 ? self->id - 1: self->id + 1)];
    // if twin pwm is active dont allow different mode
    if (twin->freq && mode != twin->mode)
        mp_raise_ValueError(MP_ERROR_TEXT("Mode must be the same inside one PWM generator"));
    // configure pwm generator
    PWMGenConfigure(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id], mode);
    // setup output pin
    if (pin)
    {
        self->pin = pin;
        pwm_set_gpio(self, 1);
    }

    pwm_update_freq(self, freq);
    pwm_update_duty(self, duty);
    pwm_update_invert(self, invert);
    pwm_update_db(self, db_falling, db_rising);
    pwm_update_irq(self, irq, irq_mode);
    pwm_update_fault(self, fault);
    PWMGenEnable(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id]);
    pwm_update_active(self, active);
}

void pwm_deinit(machine_pwm_obj_t* self)
{
    pwm_update_active(self, 0);
    // get second pwm of generator
    uint8_t twin_id = (self->id % 2 ? self->id - 1: self->id + 1);
    // if twin pwm is active dont disable generator
    if (!pwm_obj_in_use[twin_id])
        PWMGenDisable(pwm_mod_reg_map[self->mod_id], pwm_gen_reg_map[self->gen_id]);
    if (self->pin)
        pwm_set_gpio(self, 0);
    self->freq = 0;
    pwm_obj_in_use[self->id] = false;
}


// ##### helper functions #####
mp_obj_t machine_pwm_init_helper(machine_pwm_obj_t* self, size_t n_args, const mp_obj_t* pos_args, mp_map_t* kw_args, const pin_obj_t* pin)
{
    enum {ARG_pin, ARG_active, ARG_invert, ARG_freq, ARG_duty, ARG_db_falling, ARG_db_rising, ARG_mode, ARG_irq, ARG_irq_mode, ARG_fault};
    static const mp_arg_t allowed_args[] = 
    {
        {MP_QSTR_pin,           MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_obj = mp_const_none}},
        {MP_QSTR_active,        MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_int = true}},
        {MP_QSTR_invert,        MP_ARG_KW_ONLY | MP_ARG_BOOL,   {.u_int = false}},
        {MP_QSTR_freq,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_duty,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_db_falling,    MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_db_rising,     MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = 0}},
        {MP_QSTR_mode,          MP_ARG_KW_ONLY | MP_ARG_INT,    {.u_int = PWM_GEN_MODE_DOWN}},
        {MP_QSTR_irq,           MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_obj = mp_const_none}},
        {MP_QSTR_irq_mode,      MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_int = 0}},
        {MP_QSTR_fault,         MP_ARG_KW_ONLY | MP_ARG_OBJ,    {.u_obj = mp_const_none}},
    };
    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    // get arguments
    if (!pin)               // dont overwrite if created via pin
        pin =               (args[ARG_pin].u_obj == mp_const_none ? NULL: pin_find(args[ARG_pin].u_obj));

